# -*- coding: utf-8 -*-
import os

# PATHES
cwd = os.path.dirname(os.path.realpath(__file__)) + '\\'

# DATABASE CONFIGURATIONS
DBName = 'CurrencyDB.db'
TableName = 'Currencies'
TagDict = {'Dollar': ['#دلار', '#نقدی', 'نمودار قیمت دلار', 1000],  'Euro':['#یورو', 'قیمت', 'نمودار قیمت یورو', 1000],\
           'Lir': ['#حواله_لیر', 'قیمت', 'نمودار قیمت لیر ترکیه', 100], 'Tala':['#طلا', '#مظنه', 'نمودار قیمت مثقال طلا', 100000],\
           'Yuan': ['#حواله_یوان', 'قیمت', 'نمودار قیمت یوان چین', 100], 'Sekeh': ['#سکه', 'قیمت', 'نمودار قیمت تمام سکه', 100000],\
           'Dirham' : ['#درهم_دبی', 'قیمت', 'نمودار قیمت درهم دوبی', 100]}
